import { AreaData } from '@/types/ol-extensions'
import Feature from 'ol/Feature'
import { Polygon } from 'ol/geom'
import VectorSource from 'ol/source/Vector'
import { Landmark } from '@/types/ol-extensions';

// Это МОК по логике данные должны приходить с бэка
// export const areasData: AreaData[] = [
//   {
//     id: 1,
//     name: "Центральный округ",
//     coords: [
//       [37.6178, 55.7517],
//       [37.6278, 55.7617],
//       [37.6078, 55.7617],
//       [37.6178, 55.7517]
//     ]
//   },
//   {
//     id: 2,
//     name: "Северный округ",
//     coords: [
//       [37.5178, 55.8517],
//       [37.5278, 55.8617],
//       [37.5078, 55.8617],
//       [37.5178, 55.8517]
//     ]
//   }
// ]
//

export const landmarksData: Landmark[] = [
  {
    id: 1,
    name: "Московский Кремль",
    description: "Исторический комплекс в центре Москвы, официальная резиденция президента России",
    coords: [
      [37.613599, 55.748078],
      [37.612347, 55.748940],
      [37.616506, 55.755325],
      [37.621482, 55.752755],
      [37.623482, 55.749784],
      [37.617729, 55.749310],
      [37.613599, 55.748078]
    ]
  },
  {
    id: 2,
    name: "Московский зоопарк",
    description: "Один из старейших зоопарков Европы, основан в 1864 году",
    coords: [
      [37.574124, 55.765007],
      [37.577370, 55.765582],
      [37.577952, 55.765447],
      [37.579023, 55.763097],
      [37.583622, 55.765011],
      [37.585774, 55.764340],
      [37.583696, 55.760304],
      [37.582223, 55.760703],
      [37.584107, 55.762809],
      [37.584107, 55.762809],
      [37.579539, 55.762332],
      [37.578711, 55.760911],
      [37.574518, 55.761318],
      [37.574124, 55.765007]
    ]
  }
];

export function findFeatureById(
  source: VectorSource,
  id: number
): Feature<Polygon> | undefined {
  return source.getFeatures().find(f => f.get('id') === id) as Feature<Polygon>
}
